Strogino/src/Documents/Сборка/Сборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Сборка</name>
  <registerRecords>AccumulationRegister.ТоварыКСборке</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТовара</registerRecords>
  <registerRecords>AccumulationRegister.ХранениеЗСЯПоТоварам</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Холод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПотерь</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКоробкаСЦентральногоСклада</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСборки</name>
    <type>
      <types>EnumRef.ТипСборки</types>
    </type>
  </attributes>
  <attributes>
    <name>ШК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DefinedType.ДокументыРезервирующиеТовар</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
    <attributes>
      <name>Холод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНеХватило</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрогрессСборки</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DefinedType.ДокументыРезервирующиеТовар</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
    <attributes>
      <name>Холод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Зона</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стелаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНеХватило</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Потери</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DefinedType.ДокументыРезервирующиеТовар</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Strogino/src/InformationRegisters/КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ/КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗСЯ</name>
    <type>
      <types>CatalogRef.МестоЗСЯ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Strogino/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <registerRecords>InformationRegister.ОтправкаСМС</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКСборке</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТовара</registerRecords>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаСайта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сайт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Всего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ТипЦены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пробит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Собран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <type>
      <types>EnumRef.ТипДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестПростых</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестХолодных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленоСМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ККМ</name>
    <type>
      <types>CatalogRef.ККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПробития</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторПробития</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыОбработкиЗаказа</name>
    <type>
      <types>CatalogRef.СтатусыОбработкиЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаСамовывоза</name>
    <type>
      <types>CatalogRef.ТочкиСамовывоза</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКомплектацииЗаказа</name>
    <type>
      <types>EnumRef.ТипКомплектацииЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товар</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВставленИзНехватило</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПриОформлении</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Strogino/src/Documents/Сборка/ManagerModule.bsl
Функция СоздатьКомплектациюЗаказаНаОснованииСборкиЗаказа(СборкаЗаказаСсылка,Сотрудник,СсылкаДокументКомплектация) Экспорт
	
	РаспределениеЗСЯ = РаспределитьЗаказыСборкиПоЗСЯ(СборкаЗаказаСсылка);
	
	Если ТипЗнч(РаспределениеЗСЯ) = Тип("Строка") тогда
		Возврат РаспределениеЗСЯ;
	КонецЕсли;
	
	ДокументКомплектация = Документы.КомплектацияЗаказов.СоздатьДокумент();
	
	ДокументКомплектация.Дата = ТекущаяДата();
	ДокументКомплектация.ДокументОснование = СборкаЗаказаСсылка;
	ДокументКомплектация.Сотрудник = Сотрудник;
	ДокументКомплектация.Холод = СборкаЗаказаСсылка.Холод;
	ДокументКомплектация.Склад = СборкаЗаказаСсылка.Склад;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаспределениеЗСЯ.ЗСЯ,
	|	РаспределениеЗСЯ.Заказ
	|ПОМЕСТИТЬ РаспределениеЗСЯ
	|ИЗ
	|	&РаспределениеЗСЯ КАК РаспределениеЗСЯ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СборкаЗаказовТовары.Документ как Заказ,
	|	СборкаЗаказовТовары.Товар,
	|	СборкаЗаказовТовары.Партия,
	|	СборкаЗаказовТовары.КоличествоСобрано КАК Количество,
	|	РаспределениеЗСЯ.ЗСЯ КАК ЗСЯ,
	|	СборкаЗаказовТовары.КоличествоНеХватило как НеХватило
	|ИЗ
	|	Документ.Сборка.Товары КАК СборкаЗаказовТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспределениеЗСЯ КАК РаспределениеЗСЯ
	|		ПО СборкаЗаказовТовары.Документ = РаспределениеЗСЯ.Заказ
	|ГДЕ
	|	СборкаЗаказовТовары.Ссылка = &Ссылка
	|	И СборкаЗаказовТовары.КоличествоСобрано > 0";
	
	Запрос.УстановитьПараметр("Ссылка",СборкаЗаказаСсылка);
	Запрос.УстановитьПараметр("РаспределениеЗСЯ",РаспределениеЗСЯ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		СтрокаКомплектации = ДокументКомплектация.Комплектация.Добавить();		
		ЗаполнитьЗначенияСвойств(СтрокаКомплектации,Выборка);
	КонецЦикла;
	
	ДокументКомплектация.Записать(РежимЗаписиДокумента.Проведение);
	
	СсылкаДокументКомплектация = ДокументКомплектация.Ссылка;
	
	Возврат Истина;
КонецФункции

Функция РаспределитьЗаказыСборкиПоЗСЯ(СборкаЗаказаСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СборкаЗаказовТовары.Документ,
	|	СборкаЗаказовТовары.Ссылка.Холод
	|ПОМЕСТИТЬ ВТЗаказы
	|ИЗ
	|	Документ.Сборка.Товары КАК СборкаЗаказовТовары
	|ГДЕ
	|	СборкаЗаказовТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СборкаЗаказовТовары.Документ,
	|	СборкаЗаказовТовары.Ссылка.Холод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.ЗСЯ,
	|	КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.Заказ
	|ПОМЕСТИТЬ втЗаказыВЗСЯ
	|ИЗ
	|	РегистрСведений.КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ.СрезПоследних(, ) КАК КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказы КАК ВТЗаказы
	|		ПО КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.Заказ = ВТЗаказы.Документ
	|ГДЕ
	|	КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.ЗСЯ.ВидМестаЗСЯ = ЗНАЧЕНИЕ(Перечисление.ВидыМестЗСЯ.СборкаСамовывозов)
	|	И КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.ЗСЯ.ЗонаСсылка.Холод = &Холод
	|
	|СГРУППИРОВАТЬ ПО
	|	КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.Заказ,
	|	КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.ЗСЯ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказыВЗСЯ.ЗСЯ,
	|	втЗаказыВЗСЯ.Заказ
	|ИЗ
	|	втЗаказыВЗСЯ КАК втЗаказыВЗСЯ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МестоЗСЯ.Ссылка КАК ЗСЯ,
	|	МестоЗСЯ.Удобство КАК Удобство
	|ИЗ
	|	Справочник.МестоЗСЯ КАК МестоЗСЯ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ.СрезПоследних(, ) КАК КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних
	|		ПО (КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.ЗСЯ = МестоЗСЯ.Ссылка)
	|ГДЕ
	|	(КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.Заказ = ЗНАЧЕНИЕ(Документ.Заказ.ПустаяСсылка)
	|			ИЛИ КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.Заказ ЕСТЬ NULL)
	|	И МестоЗСЯ.ВидМестаЗСЯ = ЗНАЧЕНИЕ(Перечисление.ВидыМестЗСЯ.СборкаСамовывозов)
	|	И МестоЗСЯ.ЗонаСсылка.Холод = &Холод
	|	И МестоЗСЯ.ЗонаСсылка.Склад = &Склад
	|	И НЕ МестоЗСЯ.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	МестоЗСЯ.Ссылка,
	|	МестоЗСЯ.Удобство
	|
	|УПОРЯДОЧИТЬ ПО
	|	Удобство УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТЗаказы.Документ), 0) КАК КоличествоЗаказов
	|ИЗ
	|	ВТЗаказы КАК ВТЗаказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаказы.Документ КАК Заказ
	|ИЗ
	|	ВТЗаказы КАК ВТЗаказы";
	
	Запрос.УстановитьПараметр("Ссылка",СборкаЗаказаСсылка);
	Запрос.УстановитьПараметр("Холод",СборкаЗаказаСсылка.Холод);
	Запрос.УстановитьПараметр("Склад",СборкаЗаказаСсылка.Склад);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаРазложенныхЗаказов = МассивРезультатов[2].Выгрузить();
	
	ТаблицаСвободныхЗСЯ = МассивРезультатов[3].Выгрузить();
		
	ВыборкаЗаказов = МассивРезультатов[5].Выбрать();
	
	КоличестовЗаказов = 0;
	
	ВыборкаКоличестовЗаказов = МассивРезультатов[4].Выбрать();
	
	Пока ВыборкаКоличестовЗаказов.Следующий() цикл
		КоличестовЗаказов = ВыборкаКоличестовЗаказов.КоличествоЗаказов;
	КонецЦикла;
	
	КоличествоНеХватило = КоличестовЗаказов - (ТаблицаРазложенныхЗаказов.Количество() + ТаблицаСвободныхЗСЯ.Количество());
	
	Если КоличествоНеХватило > 0 тогда
		Возврат "Для комплектации заказа не хватает " + КоличествоНеХватило + " ячеек. Сообщите об этом системному администратору!!!";
	КонецЕсли;
	
	ТаблицаЗСЯ = Новый ТаблицаЗначений;
	ТаблицаЗСЯ.Колонки.Добавить("ЗСЯ",Новый ОписаниеТипов("СправочникСсылка.МестоЗСЯ"));
	ТаблицаЗСЯ.Колонки.Добавить("Заказ",Новый ОписаниеТипов("ДокументСсылка.Заказ"));
	
	Пока ВыборкаЗаказов.Следующий() цикл
		Строка = ТаблицаЗСЯ.Добавить();
		Строка.Заказ = ВыборкаЗаказов.Заказ;
		СтрокиРазложенных = ТаблицаРазложенныхЗаказов.НайтиСтроки(Новый Структура("Заказ",ВыборкаЗаказов.Заказ));
		Для каждого СтрокаРазложенных из СтрокиРазложенных цикл
			Строка.ЗСЯ = СтрокаРазложенных.ЗСЯ;
			Прервать;
		КонецЦикла;
		Если не ЗначениеЗаполнено(Строка.ЗСЯ) тогда
			Строка.ЗСЯ = ТаблицаСвободныхЗСЯ[0].ЗСЯ;
			ТаблицаСвободныхЗСЯ.Удалить(0);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаЗСЯ;
	
КонецФункции
